using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

/********************************************************************************
 ** 版 本：
 ** Copyright (c) 2015-2018 厦门攸信信息技术有限公司
 ** 创 建：詹建妹（james_zhan@intretech.com）
 ** 日 期：2019/01/15 17:04:00
 ** 描 述：
*********************************************************************************/
namespace UMS.Framework.NpoiUtil
{
    /// <summary>
    /// 常用样式类型
    /// </summary>
    public enum ExcelCellStyleType
    {
        #region 好、差、适中
        常规 = 1,

        差 = 2,

        好 = 3,

        适中 = 4,

        #endregion

        #region 数据和模型

        计算 = 5,

        检查单元格 = 6,

        解释性文本 = 7,

        警告文本 = 8,

        链接单元格 = 9,

        输出 = 10,

        输入 = 11,

        注释 = 12,

        #endregion

        #region 标题
        
        标题 = 13,

        标题1 = 14,

        标题2 = 15,

        标题3 = 16,

        标题4 = 17,

        汇总 = 18,

        #endregion

        #region 主题单元格样式
        
        强调文字颜色1_20 = 19,

        强调文字颜色2_20 = 20,

        强调文字颜色3_20 = 21,

        强调文字颜色4_20 = 22,

        强调文字颜色5_20 = 23,

        强调文字颜色6_20 = 24,


        强调文字颜色1_40 = 25,
                      
        强调文字颜色2_40 = 26,
                      
        强调文字颜色3_40 = 27,
                      
        强调文字颜色4_40 = 28,
                      
        强调文字颜色5_40 = 29,
                      
        强调文字颜色6_40 = 30,


        强调文字颜色1_60 = 31,
                      
        强调文字颜色2_60 = 32,
                      
        强调文字颜色3_60 = 33,
                      
        强调文字颜色4_60 = 34,
                      
        强调文字颜色5_60 = 35,
                      
        强调文字颜色6_60 = 36,


        强调文字颜色1 = 37,

        强调文字颜色2 = 38,

        强调文字颜色3 = 39,

        强调文字颜色4 = 40,

        强调文字颜色5 = 41,

        强调文字颜色6 = 42,
        #endregion
    }
}
