
/********************************************************************************
 ** 版 本：
 ** Copyright (c) 2015-2018 厦门攸信信息技术有限公司
 ** 创 建：詹建妹（james_zhan@intretech.com）
 ** 日 期：2019/01/15 17:04:00
 ** 描 述：
*********************************************************************************/
namespace UMS.Framework.NpoiUtil
{
    /// <summary>
    /// 分数类型
    /// </summary>
    public enum ExcelFractionType
    {
        /// <summary>
        /// 类型：# ?/?
        /// <para>分母为一位数(1/4)</para>
        /// <para>效果：0.64->2/3</para>
        /// </summary>
        分数1 = 1,

        /// <summary>
        /// 类型：# ??/??
        /// <para>分母为两位数(21/25)</para>
        /// <para>效果：0.64->16/25</para>
        /// </summary>
        分数2 = 2,

        /// <summary>
        /// 类型：# ???/???
        /// <para>分母为三位数(312/943)</para>
        /// <para>效果：0.33085->222/671</para>
        /// </summary>
        分数3 = 3,

        /// <summary>
        /// 类型：# ?/2
        /// <para>以 2 为分母(1/2)</para>
        /// <para>效果：0.64->1/2</para>
        /// </summary>
        分数4 = 4,

        /// <summary>
        /// 类型：# ?/4
        /// <para>以 4 为分母(2/4)</para>
        /// <para>效果：0.64->3/4</para>
        /// </summary>
        分数5 = 5,

        /// <summary>
        /// 类型：# ?/8
        /// <para>以 8 为分母(4/8)</para>
        /// <para>效果：0.64->5/8</para>
        /// </summary>
        分数6 = 6,

        /// <summary>
        /// 类型：# ?/16
        /// <para>以 16 为分母(8/16)</para>
        /// <para>效果：0.64->10/16</para>
        /// </summary>
        分数7 = 7,

        /// <summary>
        /// 类型：# ?/10
        /// <para>以 10 为分母(3/10)</para>
        /// <para>效果：0.64->6/10</para>
        /// </summary>
        分数8 = 8,

        /// <summary>
        /// 类型：# ??/100
        /// <para>百分之几(30/100)</para>
        /// <para>效果：0.64->64/100</para>
        /// </summary>
        分数9 = 9,
    }
}
