
/********************************************************************************
 ** 版 本：
 ** Copyright (c) 2015-2018 厦门攸信信息技术有限公司
 ** 创 建：詹建妹（james_zhan@intretech.com）
 ** 日 期：2019/01/15 17:04:00
 ** 描 述：
*********************************************************************************/
namespace UMS.Framework.NpoiUtil
{
    /// <summary>
    /// 数值类型
    /// </summary>
    public enum ExcelNumberType
    {
        /// <summary>
        /// 类型: 0
        /// <para>可用于身份证</para>
        /// <para>效果：330719196804253000</para>
        /// </summary>
        自定义1 = 1,

        /// <summary>
        /// 类型 0.00
        /// <para>效果：1000.00</para>
        /// <para>小数位可设置</para>
        /// </summary>
        自定义2 = 2,

        /// <summary>
        /// 类型 #,##0
        /// <para>效果：1,000</para>
        /// <para>字体：Arial 字号：10</para>
        /// </summary>
        货币1 = 3,

        /// <summary>
        /// 类型：#,##0.00
        /// <para>效果：1,00.00</para>
        /// <para>小数位可设置</para>
        /// <para>字体：Arial 字号：10</para>
        /// </summary>
        货币2 = 4,

        /// <summary>
        /// 类型：_ * #,##0_ ;_ * -#,##0_ ;_ * "-"_ ;_ @_ 
        /// <para>效果：1,000</para>
        /// <para>小数位可设置</para>
        /// <para>字体：宋体 字号：11</para>
        /// </summary>
        会计专用1 = 5,

        /// <summary>
        /// 类型：_ * #,##0.00_ ;_ * -#,##0.00_ ;_ * "-"??_ ;_ @_ 
        /// <para>效果：1,000.00</para>
        /// <para>小数位可设置</para>
        /// <para>字体：宋体 字号：11</para>
        /// </summary>
        会计专用2 = 6,

        /// <summary>
        /// 类型：_ ¥* #,##0_ ;_ ¥* -#,##0_ ;_ ¥* "-"_ ;_ @_ 
        /// <para>效果：￥     1,000</para>
        /// <para>货币符号可设置</para>
        /// <para>小数位可设置</para>
        /// <para>字体：宋体 字号：11</para>
        /// </summary>
        会计专用3 = 7,

        /// <summary>
        /// 类型：_ ¥* #,##0.00_ ;_ ¥* -#,##0.00_ ;_ ¥* "-"??_ ;_ @_
        /// <para>效果：￥     1,000.00</para>
        /// <para>货币符号可设置</para>
        /// <para>小数位可设置</para>
        /// <para>字体：宋体 字号：11</para>
        /// </summary>
        会计专用4 = 8,

        /// <summary>
        /// 类型：#,##0;-#,##0
        /// <para>效果： -1,000</para>
        /// </summary>
        自定义3 = 9,

        /// <summary>
        /// 类型：#,##0;[Red]-#,##0
        /// <para>效果：-1,000 字体为红色</para>
        /// </summary>
        货币3 = 10,

        /// <summary>
        /// 类型：#,##0.00;-#,##0.00
        /// <para>效果：-1,000.00</para>
        /// <para>小数位可设置</para>
        /// </summary>
        自定义4 = 11,

        /// <summary>
        /// 类型：#,##0.00;[Red]-#,##0.00
        /// <para>效果：-1,000 字体红色</para>
        /// <para>小数位可设置</para>
        /// </summary>
        货币4 = 12,

        /// <summary>
        /// 类型：¥#,##0;¥-#,##0
        /// <para>效果：￥1,000</para>
        /// <para>货币符号可设置</para>
        /// </summary>
        货币5 = 13,

        /// <summary>
        /// 类型：¥#,##0;[Red]¥-#,##0
        /// <para>效果：￥-1,000 字体红色</para>
        /// <para>货币符号可设置</para>
        /// </summary>
        货币6 = 14,

        /// <summary>
        /// 类型：¥#,##0.00;¥-#,##0.00
        /// <para>效果：￥-1,000.00</para>
        /// <para>货币符号可设置</para>
        /// <para>小数位可设置</para>
        /// </summary>
        货币7 = 15,

        /// <summary>
        /// 类型：¥#,##0.00;[Red]¥-#,##0.00
        /// <para>效果：￥-1,000.00 字体红色</para>
        /// <para>货币符号可设置</para>
        /// <para>小数位可设置</para>
        /// </summary>
        货币8 = 16,

        /// <summary>
        /// 类型：$#,##0_);($#,##0)
        /// <para>效果：($1,000)</para>
        /// <para>货币符号可设置</para>
        /// </summary>
        货币9 = 17,

        /// <summary>
        /// 类型：$#,##0_);[Red]($#,##0)
        /// <para>效果：($1,000) 字体红色</para>
        /// <para>货币符号可设置</para>
        /// </summary>
        货币10 = 18,

        /// <summary>
        /// 类型：$#,##0.00_);($#,##0.00)
        /// <para>效果：($1,000.00)</para>
        /// <para>货币符号可设置</para>
        /// <para>小数位可设置</para>
        /// </summary>
        货币11 = 19,

        /// <summary>
        /// 类型：$#,##0.00_);[Red]($#,##0.00)
        /// <para>效果：($1,000.00) 字体红色</para>
        /// <para>货币符号可设置</para>
        /// <para>小数位可设置</para>
        /// </summary>
        货币12 = 20,
    }
}
