
/********************************************************************************
 ** 版 本：
 ** Copyright (c) 2015-2018 厦门攸信信息技术有限公司
 ** 创 建：詹建妹（james_zhan@intretech.com）
 ** 日 期：2019/01/15 17:04:00
 ** 描 述：
*********************************************************************************/
namespace UMS.Framework.NpoiUtil
{
    /// <summary>
    /// 科学计数类型
    /// </summary>
    public enum ExcelCountType
    {
        /// <summary>
        /// 类型：0.00E+00
        /// <para>效果：100000 -> 1.00E+05</para>
        /// <para>小数位可设置</para>
        /// </summary>
        科学计数1 = 1,

        /// <summary>
        /// 类型：##0.0E+0
        /// <para>效果：100000 -> 100.0E+3</para>
        /// </summary>
        自定义1 = 2,
    }
}
