
/********************************************************************************
 ** 版 本：
 ** Copyright (c) 2015-2018 厦门攸信信息技术有限公司
 ** 创 建：詹建妹（james_zhan@intretech.com）
 ** 日 期：2019/01/15 17:04:00
 ** 描 述：
*********************************************************************************/
namespace UMS.Framework.NpoiUtil
{
    /// <summary>
    /// 字体大小类型
    /// </summary>
    public enum FontSizeType
    {
        初号 = 1,

        小初 = 2,

        一号 = 3,

        小一 = 4,

        二号 = 5,

        小二 = 6,

        三号 = 7,

        小三 = 8,

        四号 = 9,

        小四 = 10,

        五号 = 11,

        小五 = 12,

        六号 = 13,

        小六 = 14,

        七号 = 15,

        八号 = 16,

        Num5 = 17,

        /// <summary>
        /// 5.5
        /// </summary>
        Num5p5 = 18,

        /// <summary>
        /// 6.5
        /// </summary>
        Num6p5 = 19,

        /// <summary>
        /// 7.5
        /// </summary>
        Num7p5 = 20,

        Num8 = 21,

        Num9 = 22,

        /// <summary>
        /// 10.5
        /// </summary>
        Num10p5 = 23,

        Num11 = 24,

        Num12 = 25,

        Num14 = 26,

        Num16 = 27,

        Num18 = 28,

        Num20 = 29,

        Num22 = 30,

        Num24 = 31,

        Num26 = 32,

        Num28 = 33,

        Num36 = 34,

        Num48 = 35,

        Num72 = 36,
    }
}
